corpus/mutants/v1/non-persisted-vote/change.patch
diff --git a/raft/node.go b/raft/node.go
index 964c1f6..d1bda8d 100644
--- a/raft/node.go
+++ b/raft/node.go
@@ -152,6 +152,11 @@ func (n *Node) Step(input Input) ([]Effect, error) {
 	if dirty {
 		token := n.nextWriteToken
 		n.nextWriteToken++
+		if input.Kind == InputMessage && input.Message.Type == RequestVote && len(effects) == 2 &&
+			effects[0].Kind == EffectResetElectionTimer && effects[1].Kind == EffectSend && effects[1].Message.VoteGranted {
+			n.pending = &pendingWrite{token: token, effects: effects[:1]}
+			return []Effect{{Kind: EffectPersist, WriteToken: token, State: cloneState(n.state)}, effects[1]}, nil
+		}
 		n.pending = &pendingWrite{token: token, effects: effects}
 		return []Effect{{Kind: EffectPersist, WriteToken: token, State: cloneState(n.state)}}, nil
 	}

